In [144]:
import pandas as pd
import numpy as np
Love = pd.read_csv(r"C:\Users\Loveline\Documents\DA_materials\demo_payroll.csv")
Love

    Name   Position   Salary
0   Mike  Director$  35*0000
1  Segun         HR   200000
2  Shade    Auditor  100^000
3   Bola  Secretary    70000

In [145]:
#1st Method to clean data with REGEX
for x in Love.columns:
    Love[x]=Love[x].str.replace("\W","",regex=True)
Love

    Name   Position  Salary
0   Mike   Director  350000
1  Segun         HR  200000
2  Shade    Auditor  100000
3   Bola  Secretary   70000

In [146]:
Love.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   Position  4 non-null      object
 2   Salary    4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

In [147]:
#isna() and isnull() checks for empty dataframe
Love.isna()

    Name  Position  Salary
0  False     False   False
1  False     False   False
2  False     False   False
3  False     False   False

In [4]:
import pandas as pd
import numpy as np
Lace = pd.read_excel(r"C:\Users\Loveline\Documents\Data Cleaning.Class.xlsx",index_col="S/N")

In [5]:
Lace

         Name      Job   Age
S/N
1        John  Student  12.0
2       Nancy  Teacher  40.0
3     Abraham  Student  14.0
4       Bukky  Teacher  35.0
5      Samson  Teacher  37.0
6       Jerry  Teacher  28.0
7       Excel  Student  11.0
8     Munachi  Student  12.0
9    Princess  Student  13.0
10      Maria  Teacher  32.0
11      David  Student  12.0
12      Sonia  Student  11.0
13    Michael  Teacher  34.0
14       Mary  Student   NaN
15    Francis  Teacher   NaN

In [149]:
Lace["Age"].fillna(Lace.groupby("Job")["Age"].transform("median"),inplace=True)

In [150]:
Lace["Age"] = Lace["Age"].round(0).astype("Int64")

In [151]:
#To replace NaN OR empty values
Love.fillna(0)

    Name   Position  Salary
0   Mike   Director  350000
1  Segun         HR  200000
2  Shade    Auditor  100000
3   Bola  Secretary   70000

In [ ]:
#1st Method to clean data
Love['Salary'] = Love['Salary'].str.replace("*","").str.replace("^","")

In [ ]:
Love

In [ ]:
Love['Salary'] = pd.to_numeric(Love['Salary'],errors='coerce')
Love

In [ ]:
Love.info()

In [ ]:
#To change a datatype to another, use ASTYPE
#Channged from 
Love['Salary'].astype("int64")

In [ ]:
Love['Salary'].max()

In [ ]:
Love['Salary'].min()

In [ ]:
Love['Salary'].mean()

In [ ]:
from matplotlib import pyplot as pyplot
Love['Salary'].plot()

In [ ]:
Love['Salary'].plot(kind='bar')

In [ ]:
#2nd Method to clean data with REGEX
Love['Salary'] = Love['Salary'].str.replace("\W","",regex=True)
Love

In [ ]:
Love

In [ ]:
#To clean all data and leave only special xters, use small letter w
Love['Salary'] = Love['Salary'].str.replace("\w","",regex=True)
Love

In [ ]:
Love['Position'] = Love['Position'].str.replace("\w","",regex=True)
Love

In [ ]:
Love['Salary'] = Love['Salary'].str.replace("\w","",regex=True)
Love